yongspan/GD32E230F8_Project/tools/GD32_ISP_CLI(Windows)_V5.1.0.39034/GD32_ISP_CLI(Windows)_V5.1.0.39034/OptionBytesXML/GD32F527.xml
					<description>Sector Erase/Program Protection bit 10 for Bank1(0x082C0000~0x082DFFFF)&#x000A;0: Erase/program protection when DRP is 0. No effect when DRP is 1&#x000A;1: No effect when DRP is 0. Erase/program protection and D-bus read protection when DRP is 1</description>
					<bitOffset>2</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>WP1[9]</name>
					<brief>0x082A0000~0x082BFFFF</brief>
					<description>Sector Erase/Program Protection bit 9 for Bank1(0x082A0000~0x082BFFFF)&#x000A;0: Erase/program protection when DRP is 0. No effect when DRP is 1&#x000A;1: No effect when DRP is 0. Erase/program protection and D-bus read protection when DRP is 1</description>
					<bitOffset>1</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>WP1[8]</name>
					<brief>0x08280000~0x0829FFFF</brief>
					<description>Sector Erase/Program Protection bit 8 for Bank1(0x08280000~0x0829FFFF)&#x000A;0: Erase/program protection when DRP is 0. No effect when DRP is 1&#x000A;1: No effect when DRP is 0. Erase/program protection and D-bus read protection when DRP is 1</description>
					<bitOffset>0</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
			</fields>
		</OPByte>
		<OPByte>
			<name>WP1[19:12]</name>
			<displayName>WP1[19:12]</displayName>
			<addressOffset>0x0C</addressOffset>
			<size>0x8</size>
			<access>read-write</access>
			<reset>0xFF</reset>
			<complement>FFFF</complement>
			<fields>
				<field>
					<name>WP1[19]</name>
					<brief>0x083E0000~0x083FFFFF</brief>
					<description>Bit 19 controls the protection of the rest flash memory(0x083E0000~0x083FFFFF)&#x000A;0: Erase/program protection when DRP is 0. No effect when DRP is 1&#x000A;1: No effect when DRP is 0. Erase/program protection and D-bus read protection when DRP is 1</description>
					<bitOffset>7</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>WP1[18]</name>
					<brief>0x083C0000~0x083DFFFF</brief>
					<description>Sector Erase/Program Protection bit 18 for Bank1(0x083C0000~0x083DFFFF)&#x000A;0: Erase/program protection when DRP is 0. No effect when DRP is 1&#x000A;1: No effect when DRP is 0. Erase/program protection and D-bus read protection when DRP is 1</description>
					<bitOffset>6</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>WP1[17]</name>
					<brief>0x083A0000~0x083BFFFF</brief>
					<description>Sector Erase/Program Protection bit 17 for Bank1(0x083A0000~0x083BFFFF)&#x000A;0: Erase/program protection when DRP is 0. No effect when DRP is 1&#x000A;1: No effect when DRP is 0. Erase/program protection and D-bus read protection when DRP is 1</description>
					<bitOffset>5</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>WP1[16]</name>
					<brief>0x08380000~0x0839FFFF</brief>
					<description>Sector Erase/Program Protection bit 16 for Bank1(0x08380000~0x0839FFFF)&#x000A;0: Erase/program protection when DRP is 0. No effect when DRP is 1&#x000A;1: No effect when DRP is 0. Erase/program protection and D-bus read protection when DRP is 1</description>
					<bitOffset>4</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>WP1[15]</name>
					<brief>0x08360000~0x0837FFFF</brief>
					<description>Sector Erase/Program Protection bit 15 for Bank1(0x08360000~0x0837FFFF)&#x000A;0: Erase/program protection when DRP is 0. No effect when DRP is 1&#x000A;1: No effect when DRP is 0. Erase/program protection and D-bus read protection when DRP is 1</description>
					<bitOffset>3</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>WP1[14]</name>
					<brief>0x08340000~0x0835FFFF</brief>
					<description>Sector Erase/Program Protection bit 14 for Bank1(0x08340000~0x0835FFFF)&#x000A;0: Erase/program protection when DRP is 0. No effect when DRP is 1&#x000A;1: No effect when DRP is 0. Erase/program protection and D-bus read protection when DRP is 1</description>
					<bitOffset>2</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>WP1[13]</name>
					<brief>0x08320000~0x0833FFFF</brief>
					<description>Sector Erase/Program Protection bit 13 for Bank1(0x08320000~0x0833FFFF)&#x000A;0: Erase/program protection when DRP is 0. No effect when DRP is 1&#x000A;1: No effect when DRP is 0. Erase/program protection and D-bus read protection when DRP is 1</description>
					<bitOffset>1</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>WP1[12]</name>
					<brief>0x08300000~0x0831FFFF</brief>
					<description>Sector Erase/Program Protection bit 12 for Bank1(0x08300000~0x0831FFFF)&#x000A;0: Erase/program protection when DRP is 0. No effect when DRP is 1&#x000A;1: No effect when DRP is 0. Erase/program protection and D-bus read protection when DRP is 1</description>
					<bitOffset>0</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
			</fields>
		</OPByte>
	</OPBytes>
	<OPBytes baseAddress="0x40023E08" length="8" RegType="Efuse">
		<OPByte>
			<name>EFUSE_CTL</name>
			<displayName>EFUSE_CTL</displayName>
			<addressOffset>0x00</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<complement>FFFF</complement>
			<fields>
				<field>
					<name>LK</name>
					<brief>EFUSE_CTL lock bit</brief>
					<description>0: no lock&#x000A;1: lock</description>
					<bitOffset>7</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>UDLK</name>
					<brief>EFUSE_USER_DATA register lock bit</brief>
					<description>0: Unlock EFUSE_USER_DATA register&#x000A;1: Lock EFUSE_USER_DATA register</description>
					<bitOffset>6</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>BTFOSEL</name>
					<brief>Select Boot from flash or OTP1. This bit actives when NSBL is 1 or BOOT0 is 0</brief>
					<description>0: boot from main flash block&#x000A;1: boot from flash OTP1 block</description>
					<bitOffset>3</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>NBTSB</name>
					<brief>Not boot from SRAM or bootloader</brief>
					<description>0: can boot from SRAM or bootloader&#x000A;1: can’t boot from SRAM or bootloader</description>
					<bitOffset>2</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>NDBG</name>
					<brief>Debugging permission setting</brief>
					<description>0: no influence&#x000A;1: Can not debug</description>
					<bitOffset>1</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>EFSPC</name>
					<brief>Efuse Security protection. Forbid SPC from no protect to level low</brief>
					<description>0: no protect&#x000A;1: force chip SPC level low</description>
					<bitOffset>0</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
			</fields>
		</OPByte>
		<OPByte>
			<name>EFUSE_USER_DATA</name>
			<displayName>EFUSE_USER_DATA</displayName>
			<addressOffset>0x04</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<complement>FFFF</complement>
			<fields>
				<field>
					<name>USERDATA[7:0]</name>
					<brief>Efuse USER_DATA value</brief>
					<description>Efuse USER_DATA value</description>
					<bitOffset>0</bitOffset>
					<bitWidth>8</bitWidth>
				</field>
			</fields>
		</OPByte>
	</OPBytes>
</OPBytesArchitecture>
<OTPBytesBlocks>
    <OTPBlocks baseAddress="0x1FFF7800" length="64"/>
	<OTPBlocks baseAddress="0x1FF00000" length="131072"/>
	<OTPBlocks baseAddress="0x1FF20000" length="512"/>
</OTPBytesBlocks>
<OTPBytes baseAddress="0x1FFF7800" length="64">
    <OTPBlocks>
        <name>OTP0</name>
		<displayName>OTP0</displayName>
        <minProgrammeWidth>0x08</minProgrammeWidth>
		<maxProgrammeWidth>0x40</maxProgrammeWidth>
		<lockBaseAddress>0x1FFF7840</lockBaseAddress>
		<BlockCnt>0x40</BlockCnt>
		<baseAddress>0x1FFF7800</baseAddress>
		<endAddress>0x1FFF783F</endAddress>
        <fields>
		   <field>
                <name>OTP0_Lock0</name>
				<displayName>OTP0_Lock0</displayName>
                <baseAddress>0x1FFF7800</baseAddress>
		        <endAddress>0x1FFF7800</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x00</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock1</name>
				<displayName>OTP0_Lock1</displayName>
                <baseAddress>0x1FFF7801</baseAddress>
		        <endAddress>0x1FFF7801</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x01</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock2</name>
				<displayName>OTP0_Lock2</displayName>
                <baseAddress>0x1FFF7802</baseAddress>
		        <endAddress>0x1FFF7802</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x02</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock3</name>
				<displayName>OTP0_Lock3</displayName>
                <baseAddress>0x1FFF7803</baseAddress>
		        <endAddress>0x1FFF7803</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x03</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock4</name>
				<displayName>OTP0_Lock4</displayName>
                <baseAddress>0x1FFF7804</baseAddress>
		        <endAddress>0x1FFF7804</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x04</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock5</name>
				<displayName>OTP0_Lock5</displayName>
                <baseAddress>0x1FFF7805</baseAddress>
		        <endAddress>0x1FFF7805</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x05</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock6</name>
				<displayName>OTP0_Lock6</displayName>
                <baseAddress>0x1FFF7806</baseAddress>
		        <endAddress>0x1FFF7806</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x06</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock7</name>
				<displayName>OTP0_Lock7</displayName>
                <baseAddress>0x1FFF7807</baseAddress>
		        <endAddress>0x1FFF7807</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x07</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock8</name>
				<displayName>OTP0_Lock8</displayName>
                <baseAddress>0x1FFF7808</baseAddress>
		        <endAddress>0x1FFF7808</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x08</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock9</name>
				<displayName>OTP0_Lock9</displayName>
                <baseAddress>0x1FFF7809</baseAddress>
		        <endAddress>0x1FFF7809</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x09</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock10</name>
				<displayName>OTP0_Lock10</displayName>
                <baseAddress>0x1FFF780A</baseAddress>
		        <endAddress>0x1FFF780A</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x0A</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock11</name>
				<displayName>OTP0_Lock11</displayName>
                <baseAddress>0x1FFF780B</baseAddress>
		        <endAddress>0x1FFF780B</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x0B</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock12</name>
				<displayName>OTP0_Lock12</displayName>
                <baseAddress>0x1FFF780C</baseAddress>
		        <endAddress>0x1FFF780C</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x0C</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock13</name>
				<displayName>OTP0_Lock13</displayName>
                <baseAddress>0x1FFF780D</baseAddress>
		        <endAddress>0x1FFF780D</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x0D</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock14</name>
				<displayName>OTP0_Lock14</displayName>
                <baseAddress>0x1FFF780E</baseAddress>
		        <endAddress>0x1FFF780E</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x0E</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock15</name>
				<displayName>OTP0_Lock15</displayName>
                <baseAddress>0x1FFF780F</baseAddress>
		        <endAddress>0x1FFF780F</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x0F</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock16</name>
				<displayName>OTP0_Lock16</displayName>
                <baseAddress>0x1FFF7810</baseAddress>
		        <endAddress>0x1FFF7810</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x10</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock17</name>
				<displayName>OTP0_Lock17</displayName>
                <baseAddress>0x1FFF7811</baseAddress>
		        <endAddress>0x1FFF7811</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x11</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock18</name>
				<displayName>OTP0_Lock18</displayName>
                <baseAddress>0x1FFF7812</baseAddress>
		        <endAddress>0x1FFF7812</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x12</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock19</name>
				<displayName>OTP0_Lock19</displayName>
                <baseAddress>0x1FFF7813</baseAddress>
		        <endAddress>0x1FFF7813</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x13</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock20</name>
				<displayName>OTP0_Lock20</displayName>
                <baseAddress>0x1FFF7814</baseAddress>
		        <endAddress>0x1FFF7814</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x14</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock21</name>
				<displayName>OTP0_Lock21</displayName>
                <baseAddress>0x1FFF7815</baseAddress>
		        <endAddress>0x1FFF7815</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x15</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock22</name>
				<displayName>OTP0_Lock22</displayName>
                <baseAddress>0x1FFF7816</baseAddress>
		        <endAddress>0x1FFF7816</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x16</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock23</name>
				<displayName>OTP0_Lock23</displayName>
                <baseAddress>0x1FFF7817</baseAddress>
		        <endAddress>0x1FFF7817</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x17</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock24</name>
				<displayName>OTP0_Lock24</displayName>
                <baseAddress>0x1FFF7818</baseAddress>
		        <endAddress>0x1FFF7818</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x18</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock25</name>
				<displayName>OTP0_Lock25</displayName>
                <baseAddress>0x1FFF7819</baseAddress>
		        <endAddress>0x1FFF7819</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x19</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock26</name>
				<displayName>OTP0_Lock26</displayName>
                <baseAddress>0x1FFF781A</baseAddress>
		        <endAddress>0x1FFF781A</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x1A</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock27</name>
				<displayName>OTP0_Lock27</displayName>
                <baseAddress>0x1FFF781B</baseAddress>
		        <endAddress>0x1FFF781B</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x1B</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock28</name>
				<displayName>OTP0_Lock28</displayName>
                <baseAddress>0x1FFF781C</baseAddress>
		        <endAddress>0x1FFF781C</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x1C</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock29</name>
				<displayName>OTP0_Lock29</displayName>
                <baseAddress>0x1FFF781D</baseAddress>
		        <endAddress>0x1FFF781D</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x1D</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock30</name>
				<displayName>OTP0_Lock30</displayName>
                <baseAddress>0x1FFF781E</baseAddress>
		        <endAddress>0x1FFF781E</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x1E</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock31</name>
				<displayName>OTP0_Lock31</displayName>
                <baseAddress>0x1FFF781F</baseAddress>
		        <endAddress>0x1FFF781F</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x1F</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock32</name>
				<displayName>OTP0_Lock32</displayName>
                <baseAddress>0x1FFF7820</baseAddress>
		        <endAddress>0x1FFF7820</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x20</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock33</name>
				<displayName>OTP0_Lock33</displayName>
                <baseAddress>0x1FFF7821</baseAddress>
		        <endAddress>0x1FFF7821</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x21</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock34</name>
				<displayName>OTP0_Lock34</displayName>
                <baseAddress>0x1FFF7822</baseAddress>
		        <endAddress>0x1FFF7822</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x22</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock35</name>
				<displayName>OTP0_Lock35</displayName>
                <baseAddress>0x1FFF7823</baseAddress>
		        <endAddress>0x1FFF7823</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x23</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock36</name>
				<displayName>OTP0_Lock36</displayName>
                <baseAddress>0x1FFF7824</baseAddress>
		        <endAddress>0x1FFF7824</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x24</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock37</name>
				<displayName>OTP0_Lock37</displayName>
                <baseAddress>0x1FFF7825</baseAddress>
		        <endAddress>0x1FFF7825</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x25</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock38</name>
				<displayName>OTP0_Lock38</displayName>
                <baseAddress>0x1FFF7826</baseAddress>
		        <endAddress>0x1FFF7826</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x26</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock39</name>
				<displayName>OTP0_Lock39</displayName>
                <baseAddress>0x1FFF7827</baseAddress>
		        <endAddress>0x1FFF7827</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x27</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock40</name>
				<displayName>OTP0_Lock40</displayName>
                <baseAddress>0x1FFF7828</baseAddress>
		        <endAddress>0x1FFF7828</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x28</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock41</name>
				<displayName>OTP0_Lock41</displayName>
                <baseAddress>0x1FFF7829</baseAddress>
		        <endAddress>0x1FFF7829</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x29</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock42</name>
				<displayName>OTP0_Lock42</displayName>
                <baseAddress>0x1FFF782A</baseAddress>
		        <endAddress>0x1FFF782A</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x2A</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
