yongspan/GD32E230F8_Project/tools/GD32_ISP_CLI(Windows)_V5.1.0.39034/GD32_ISP_CLI(Windows)_V5.1.0.39034/OptionBytesXML/GD32F527.xml
                <name>OTP0_Lock43</name>
				<displayName>OTP0_Lock43</displayName>
                <baseAddress>0x1FFF782B</baseAddress>
		        <endAddress>0x1FFF782B</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x2B</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock44</name>
				<displayName>OTP0_Lock44</displayName>
                <baseAddress>0x1FFF782C</baseAddress>
		        <endAddress>0x1FFF782C</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x2C</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock45</name>
				<displayName>OTP0_Lock45</displayName>
                <baseAddress>0x1FFF782D</baseAddress>
		        <endAddress>0x1FFF782D</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x2D</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock46</name>
				<displayName>OTP0_Lock46</displayName>
                <baseAddress>0x1FFF782E</baseAddress>
		        <endAddress>0x1FFF782E</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x2E</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock47</name>
				<displayName>OTP0_Lock47</displayName>
                <baseAddress>0x1FFF782F</baseAddress>
		        <endAddress>0x1FFF782F</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x2F</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock48</name>
				<displayName>OTP0_Lock48</displayName>
                <baseAddress>0x1FFF7830</baseAddress>
		        <endAddress>0x1FFF7830</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x30</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock49</name>
				<displayName>OTP0_Lock49</displayName>
                <baseAddress>0x1FFF7831</baseAddress>
		        <endAddress>0x1FFF7831</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x31</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock50</name>
				<displayName>OTP0_Lock50</displayName>
                <baseAddress>0x1FFF7832</baseAddress>
		        <endAddress>0x1FFF7832</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x32</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock51</name>
				<displayName>OTP0_Lock51</displayName>
                <baseAddress>0x1FFF7833</baseAddress>
		        <endAddress>0x1FFF7833</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x33</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock52</name>
				<displayName>OTP0_Lock52</displayName>
                <baseAddress>0x1FFF7834</baseAddress>
		        <endAddress>0x1FFF7834</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x34</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock53</name>
				<displayName>OTP0_Lock53</displayName>
                <baseAddress>0x1FFF7835</baseAddress>
		        <endAddress>0x1FFF7835</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x35</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock54</name>
				<displayName>OTP0_Lock54</displayName>
                <baseAddress>0x1FFF7836</baseAddress>
		        <endAddress>0x1FFF7836</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x36</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock55</name>
				<displayName>OTP0_Lock55</displayName>
                <baseAddress>0x1FFF7837</baseAddress>
		        <endAddress>0x1FFF7837</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x37</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock56</name>
				<displayName>OTP0_Lock56</displayName>
                <baseAddress>0x1FFF7838</baseAddress>
		        <endAddress>0x1FFF7838</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x38</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock57</name>
				<displayName>OTP0_Lock57</displayName>
                <baseAddress>0x1FFF7839</baseAddress>
		        <endAddress>0x1FFF7839</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x39</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock58</name>
				<displayName>OTP0_Lock58</displayName>
                <baseAddress>0x1FFF783A</baseAddress>
		        <endAddress>0x1FFF783A</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x3A</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock59</name>
				<displayName>OTP0_Lock59</displayName>
                <baseAddress>0x1FFF783B</baseAddress>
		        <endAddress>0x1FFF783B</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x3B</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
				<field>
                <name>OTP0_Lock60</name>
				<displayName>OTP0_Lock60</displayName>
                <baseAddress>0x1FFF783C</baseAddress>
		        <endAddress>0x1FFF783C</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x3C</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock61</name>
				<displayName>OTP0_Lock61</displayName>
                <baseAddress>0x1FFF783D</baseAddress>
		        <endAddress>0x1FFF783D</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x3D</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock62</name>
				<displayName>OTP0_Lock62</displayName>
                <baseAddress>0x1FFF783E</baseAddress>
		        <endAddress>0x1FFF783E</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x3E</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP0_Lock63</name>
				<displayName>OTP0_Lock63</displayName>
                <baseAddress>0x1FFF783F</baseAddress>
		        <endAddress>0x1FFF783F</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x01</size>
				<lockOffset>0x3F</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
        </fields>
    </OTPBlocks>
</OTPBytes>
<OTPBytes baseAddress="0x1FF00000" length="131072">
    <OTPBlocks>
        <name>OTP1</name>
		<displayName>OTP1</displayName>
        <minProgrammeWidth>0x08</minProgrammeWidth>
		<maxProgrammeWidth>0x40</maxProgrammeWidth>
		<lockBaseAddress>0x1FF20200</lockBaseAddress>
		<BlockCnt>0x10</BlockCnt>
		<baseAddress>0x1FF00000</baseAddress>
		<endAddress>0x1FF1FFFF</endAddress>
        <fields>
		    <field>
                <name>OTP1_Lock0</name>
				<displayName>OTP1_Lock0</displayName>
                <baseAddress>0x1FF00000</baseAddress>
		        <endAddress>0x1FF01FFF</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x2000</size>
				<lockOffset>0x00</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP1_Lock1</name>
				<displayName>OTP1_Lock1</displayName>
                <baseAddress>0x1FF02000</baseAddress>
		        <endAddress>0x1FF03FFF</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x2000</size>
				<lockOffset>0x01</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP1_Lock2</name>
				<displayName>OTP1_Lock2</displayName>
                <baseAddress>0x1FF04000</baseAddress>
		        <endAddress>0x1FF05FFF</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x2000</size>
				<lockOffset>0x02</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP1_Lock3</name>
				<displayName>OTP1_Lock3</displayName>
                <baseAddress>0x1FF06000</baseAddress>
		        <endAddress>0x1FF07FFF</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x2000</size>
				<lockOffset>0x03</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP1_Lock4</name>
				<displayName>OTP1_Lock4</displayName>
                <baseAddress>0x1FF08000</baseAddress>
		        <endAddress>0x1FF09FFF</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x2000</size>
				<lockOffset>0x04</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP1_Lock5</name>
				<displayName>OTP1_Lock5</displayName>
                <baseAddress>0x1FF0A000</baseAddress>
		        <endAddress>0x1FF0BFFF</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x2000</size>
				<lockOffset>0x05</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP1_Lock6</name>
				<displayName>OTP1_Lock6</displayName>
                <baseAddress>0x1FF0C000</baseAddress>
		        <endAddress>0x1FF0DFFF</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x2000</size>
				<lockOffset>0x06</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP1_Lock7</name>
				<displayName>OTP1_Lock7</displayName>
                <baseAddress>0x1FF0E000</baseAddress>
		        <endAddress>0x1FF0FFFF</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x2000</size>
				<lockOffset>0x07</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP1_Lock8</name>
				<displayName>OTP1_Lock8</displayName>
                <baseAddress>0x1FF10000</baseAddress>
		        <endAddress>0x1FF11FFF</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x2000</size>
				<lockOffset>0x08</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP1_Lock9</name>
				<displayName>OTP1_Lock9</displayName>
                <baseAddress>0x1FF12000</baseAddress>
		        <endAddress>0x1FF13FFF</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x2000</size>
				<lockOffset>0x09</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP1_Lock10</name>
				<displayName>OTP1_Lock10</displayName>
                <baseAddress>0x1FF14000</baseAddress>
		        <endAddress>0x1FF15FFF</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x2000</size>
				<lockOffset>0x0A</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP1_Lock11</name>
				<displayName>OTP1_Lock11</displayName>
                <baseAddress>0x1FF16000</baseAddress>
		        <endAddress>0x1FF17FFF</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x2000</size>
				<lockOffset>0x0B</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP1_Lock12</name>
				<displayName>OTP1_Lock12</displayName>
                <baseAddress>0x1FF18000</baseAddress>
		        <endAddress>0x1FF19FFF</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x2000</size>
				<lockOffset>0x0C</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP1_Lock13</name>
				<displayName>OTP1_Lock13</displayName>
                <baseAddress>0x1FF1A000</baseAddress>
		        <endAddress>0x1FF1BFFF</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x2000</size>
				<lockOffset>0x0D</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP1_Lock14</name>
				<displayName>OTP1_Lock14</displayName>
                <baseAddress>0x1FF1C000</baseAddress>
		        <endAddress>0x1FF1DFFF</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x2000</size>
				<lockOffset>0x0E</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP1_Lock15</name>
				<displayName>OTP1_Lock15</displayName>
                <baseAddress>0x1FF1E000</baseAddress>
		        <endAddress>0x1FF1FFFF</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x2000</size>
				<lockOffset>0x0F</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
		</fields>
    </OTPBlocks>
</OTPBytes>
<OTPBytes baseAddress="0x1FF20000" length="512">
    <OTPBlocks>
        <name>OTP2</name>
		<displayName>OTP2</displayName>
        <minProgrammeWidth>0x08</minProgrammeWidth>
		<maxProgrammeWidth>0x40</maxProgrammeWidth>
		<lockBaseAddress>0x1FF20210</lockBaseAddress>
		<BlockCnt>0x20</BlockCnt>
		<baseAddress>0x1FF20000</baseAddress>
		<endAddress>0x1FF201FF</endAddress>
        <fields>
		    <field>
                <name>OTP2_Lock0</name>
				<displayName>OTP2_Lock0</displayName>
                <baseAddress>0x1FF20000</baseAddress>
		        <endAddress>0x1FF2001F</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x00</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP2_Lock1</name>
				<displayName>OTP2_Lock1</displayName>
                <baseAddress>0x1FF20020</baseAddress>
		        <endAddress>0x1FF2003F</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x01</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP2_Lock2</name>
				<displayName>OTP2_Lock2</displayName>
                <baseAddress>0x1FF20040</baseAddress>
		        <endAddress>0x1FF2005F</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x02</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP2_Lock3</name>
				<displayName>OTP2_Lock3</displayName>
                <baseAddress>0x1FF20060</baseAddress>
		        <endAddress>0x1FF2007F</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x03</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP2_Lock4</name>
				<displayName>OTP2_Lock4</displayName>
                <baseAddress>0x1FF20080</baseAddress>
		        <endAddress>0x1FF2009F</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x04</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP2_Lock5</name>
				<displayName>OTP2_Lock5</displayName>
                <baseAddress>0x1FF200A0</baseAddress>
		        <endAddress>0x1FF200BF</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x05</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP2_Lock6</name>
				<displayName>OTP2_Lock6</displayName>
                <baseAddress>0x1FF200C0</baseAddress>
		        <endAddress>0x1FF200DF</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x06</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP2_Lock7</name>
				<displayName>OTP2_Lock7</displayName>
                <baseAddress>0x1FF200E0</baseAddress>
		        <endAddress>0x1FF200FF</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x07</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP2_Lock8</name>
				<displayName>OTP2_Lock8</displayName>
                <baseAddress>0x1FF20100</baseAddress>
		        <endAddress>0x1FF2011F</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x08</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP2_Lock9</name>
				<displayName>OTP2_Lock9</displayName>
                <baseAddress>0x1FF20120</baseAddress>
		        <endAddress>0x1FF2013F</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x09</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP2_Lock10</name>
				<displayName>OTP2_Lock10</displayName>
                <baseAddress>0x1FF20140</baseAddress>
		        <endAddress>0x1FF2015F</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x0A</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP2_Lock11</name>
				<displayName>OTP2_Lock11</displayName>
                <baseAddress>0x1FF20160</baseAddress>
		        <endAddress>0x1FF2017F</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x0B</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP2_Lock12</name>
				<displayName>OTP2_Lock12</displayName>
                <baseAddress>0x1FF20180</baseAddress>
		        <endAddress>0x1FF2019F</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x0C</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP2_Lock13</name>
				<displayName>OTP2_Lock13</displayName>
                <baseAddress>0x1FF201A0</baseAddress>
		        <endAddress>0x1FF201BF</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x0D</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP2_Lock14</name>
				<displayName>OTP2_Lock14</displayName>
                <baseAddress>0x1FF201C0</baseAddress>
		        <endAddress>0x1FF201DF</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x0E</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name>OTP2_Lock15</name>
				<displayName>OTP2_Lock15</displayName>
                <baseAddress>0x1FF201E0</baseAddress>
		        <endAddress>0x1FF201FF</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x0F</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name LockType="ReadLock">OTP2_Lock16</name>
				<displayName>OTP2_Lock16</displayName>
                <baseAddress>0x1FF20000</baseAddress>
		        <endAddress>0x1FF2001F</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x10</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name LockType="ReadLock">OTP2_Lock17</name>
				<displayName>OTP2_Lock17</displayName>
                <baseAddress>0x1FF20020</baseAddress>
		        <endAddress>0x1FF2003F</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x11</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name LockType="ReadLock">OTP2_Lock18</name>
				<displayName>OTP2_Lock18</displayName>
                <baseAddress>0x1FF20040</baseAddress>
		        <endAddress>0x1FF2005F</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x12</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name LockType="ReadLock">OTP2_Lock19</name>
				<displayName>OTP2_Lock19</displayName>
                <baseAddress>0x1FF20060</baseAddress>
		        <endAddress>0x1FF2007F</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x13</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name LockType="ReadLock">OTP2_Lock20</name>
				<displayName>OTP2_Lock20</displayName>
                <baseAddress>0x1FF20080</baseAddress>
		        <endAddress>0x1FF2009F</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x14</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name LockType="ReadLock">OTP2_Lock21</name>
				<displayName>OTP2_Lock21</displayName>
                <baseAddress>0x1FF200A0</baseAddress>
		        <endAddress>0x1FF200BF</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x15</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name LockType="ReadLock">OTP2_Lock22</name>
				<displayName>OTP2_Lock22</displayName>
                <baseAddress>0x1FF200C0</baseAddress>
		        <endAddress>0x1FF200DF</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x16</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name LockType="ReadLock">OTP2_Lock23</name>
				<displayName>OTP2_Lock23</displayName>
                <baseAddress>0x1FF200E0</baseAddress>
		        <endAddress>0x1FF200FF</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x17</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name LockType="ReadLock">OTP2_Lock24</name>
