yongspan/GD32E230F8_Project/tools/GD32_ISP_CLI(Windows)_V5.1.0.39034/GD32_ISP_CLI(Windows)_V5.1.0.39034/OptionBytesXML/GD32F527.xml
				<displayName>OTP2_Lock24</displayName>
                <baseAddress>0x1FF20100</baseAddress>
		        <endAddress>0x1FF2011F</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x18</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name LockType="ReadLock">OTP2_Lock25</name>
				<displayName>OTP2_Lock25</displayName>
                <baseAddress>0x1FF20120</baseAddress>
		        <endAddress>0x1FF2013F</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x19</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name LockType="ReadLock">OTP2_Lock26</name>
				<displayName>OTP2_Lock26</displayName>
                <baseAddress>0x1FF20140</baseAddress>
		        <endAddress>0x1FF2015F</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x1A</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name LockType="ReadLock">OTP2_Lock27</name>
				<displayName>OTP2_Lock27</displayName>
                <baseAddress>0x1FF20160</baseAddress>
		        <endAddress>0x1FF2017F</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x1B</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name LockType="ReadLock">OTP2_Lock28</name>
				<displayName>OTP2_Lock28</displayName>
                <baseAddress>0x1FF20180</baseAddress>
		        <endAddress>0x1FF2019F</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x1C</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name LockType="ReadLock">OTP2_Lock29</name>
				<displayName>OTP2_Lock29</displayName>
                <baseAddress>0x1FF201A0</baseAddress>
		        <endAddress>0x1FF201BF</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x1D</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name LockType="ReadLock">OTP2_Lock30</name>
				<displayName>OTP2_Lock30</displayName>
                <baseAddress>0x1FF201C0</baseAddress>
		        <endAddress>0x1FF201DF</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x1E</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
			<field>
                <name LockType="ReadLock">OTP2_Lock31</name>
				<displayName>OTP2_Lock31</displayName>
                <baseAddress>0x1FF201E0</baseAddress>
		        <endAddress>0x1FF201FF</endAddress>	
				<ifHasLockArea>0x1</ifHasLockArea>
				<size>0x20</size>
				<lockOffset>0x1F</lockOffset>
				<lockbitWidth>8</lockbitWidth>
				<LockVal>0x00</LockVal>
            </field>
		</fields>
    </OTPBlocks>
</OTPBytes>
